Bwooce/tinygs_nRF52/src/main.cpp
    return dns_result;
}

/* -------------------------------------------------------------------------- */
/* MQTT Event Handler                                                          */
/* -------------------------------------------------------------------------- */

static void mqtt_evt_handler(struct mqtt_client *client, const struct mqtt_evt *evt)
{
    switch (evt->type) {
    case MQTT_EVT_CONNACK:
        if (evt->result == 0) {
            LOG_INF("MQTT CONNECTED to %s:%d", MQTT_BROKER_HOSTNAME, MQTT_BROKER_PORT);
            app_state = STATE_MQTT_CONNECTED;
        } else {
            LOG_ERR("MQTT CONNACK error: %d", evt->result);
            app_state = STATE_ERROR;
        }
        break;

    case MQTT_EVT_DISCONNECT:
        LOG_WRN("MQTT disconnected: %d", evt->result);
        app_state = STATE_ERROR;
        break;

    case MQTT_EVT_PUBLISH: {
        const struct mqtt_publish_param *pub = &evt->param.publish;
        LOG_INF("MQTT PUBLISH on topic len=%u, payload len=%u",
                pub->message.topic.topic.size,
                pub->message.payload.len);
        break;
    }

    case MQTT_EVT_SUBACK:
        LOG_INF("MQTT SUBACK id=%u result=%d",
                evt->param.suback.message_id, evt->result);
        break;

    default:
        LOG_DBG("MQTT event: %d", evt->type);
        break;
    }
}

/* -------------------------------------------------------------------------- */
/* MQTT-TLS Connection                                                         */
/* -------------------------------------------------------------------------- */

/*
 * TLS socket test — connect directly to mqtt.tinygs.com via public NAT64.
 * Google NAT64 prefix: 64:ff9b::/96
 * mqtt.tinygs.com = 159.195.74.23 → 64:ff9b::9fc3:4a17
 */
static int test_tls_nat64(void)
{
    struct sockaddr_in6 dest;
    memset(&dest, 0, sizeof(dest));
    dest.sin6_family = AF_INET6;
    dest.sin6_port = htons(8883);

    /* 64:ff9b::9fc3:4a17 (mqtt.tinygs.com via Google NAT64) */
    otIp6Address nat64;
    memset(&nat64, 0, sizeof(nat64));
    nat64.mFields.m16[0] = htons(0x0064);
    nat64.mFields.m16[1] = htons(0xff9b);
    /* m16[2..5] = 0 */
    nat64.mFields.m8[12] = 159;
    nat64.mFields.m8[13] = 195;
    nat64.mFields.m8[14] = 74;
    nat64.mFields.m8[15] = 23;
    memcpy(&dest.sin6_addr, &nat64, 16);

    char addr_str[INET6_ADDRSTRLEN];
    net_addr_ntop(AF_INET6, &dest.sin6_addr, addr_str, sizeof(addr_str));

    /* Test 1: Plain TCP to public NAT64 address */
    LOG_INF("NAT64 test: TCP to [%s]:8883 ...", addr_str);
    int sock = zsock_socket(AF_INET6, SOCK_STREAM, IPPROTO_TCP);
    if (sock >= 0) {
        int ret = zsock_connect(sock, (struct sockaddr *)&dest, sizeof(dest));
        if (ret == 0) {
            LOG_INF("=== NAT64 TCP SUCCEEDED! ===");
        } else {
            LOG_ERR("NAT64 TCP connect failed: errno=%d", errno);
        }
        zsock_close(sock);
    }

    /* Test 2: TLS socket to same address */
    LOG_INF("NAT64 test: TLS to [%s]:8883 ...", addr_str);
    sock = zsock_socket(AF_INET6, SOCK_STREAM, IPPROTO_TLS_1_2);
    if (sock >= 0) {
        int peer_verify = TLS_PEER_VERIFY_NONE;
        zsock_setsockopt(sock, SOL_TLS, TLS_PEER_VERIFY,
                          &peer_verify, sizeof(peer_verify));

        int ret = zsock_connect(sock, (struct sockaddr *)&dest, sizeof(dest));
        if (ret == 0) {
            LOG_INF("=== NAT64 TLS SUCCEEDED! ===");
        } else {
            LOG_ERR("NAT64 TLS connect failed: errno=%d", errno);
        }
        zsock_close(sock);
    } else {
        LOG_ERR("NAT64 TLS socket() failed: errno=%d", errno);
    }

    return 0;
}

static int mqtt_tls_connect(void)
{
    LOG_INF("Connecting MQTT to [%s]:%d ...", MQTT_BROKER_HOSTNAME, MQTT_BROKER_PORT);

    mqtt_client_init(&mqtt_client);

    mqtt_client.broker = &broker_addr;

    /* Client ID and credentials */
    mqtt_client.client_id.utf8 = (uint8_t *)MQTT_CLIENT_ID;
    mqtt_client.client_id.size = strlen(MQTT_CLIENT_ID);

    static struct mqtt_utf8 username = {
        .utf8 = (uint8_t *)MQTT_USERNAME,
        .size = sizeof(MQTT_USERNAME) - 1,
    };
    static struct mqtt_utf8 password = {
        .utf8 = (uint8_t *)MQTT_PASSWORD,
        .size = sizeof(MQTT_PASSWORD) - 1,
    };
    mqtt_client.user_name = &username;
    mqtt_client.password = &password;

    /* Buffers */
    mqtt_client.rx_buf = mqtt_rx_buf;
    mqtt_client.rx_buf_size = sizeof(mqtt_rx_buf);
    mqtt_client.tx_buf = mqtt_tx_buf;
    mqtt_client.tx_buf_size = sizeof(mqtt_tx_buf);

    /* Event handler */
    mqtt_client.evt_cb = mqtt_evt_handler;

    /* TLS direct to mqtt.tinygs.com via nat64.net public NAT64 */
    mqtt_client.transport.type = MQTT_TRANSPORT_SECURE;

    struct mqtt_sec_config *tls_cfg = &mqtt_client.transport.tls.config;
    tls_cfg->peer_verify = TLS_PEER_VERIFY_NONE;
    tls_cfg->cipher_list = NULL;
    tls_cfg->sec_tag_list = NULL;
    tls_cfg->sec_tag_count = 0;
    tls_cfg->hostname = MQTT_BROKER_HOSTNAME;

    LOG_INF("Connecting...");

    int ret = mqtt_connect(&mqtt_client);
    if (ret != 0) {
        LOG_ERR("mqtt_connect() failed: %d (errno=%d)", ret, errno);
        return ret;
    }

    LOG_INF("mqtt_connect() returned OK, waiting for CONNACK...");
    return 0;
}

/* -------------------------------------------------------------------------- */
/* USB MSC & FATFS                                                             */
/* -------------------------------------------------------------------------- */

static FATFS fat_fs;
static struct fs_mount_t mp = {
    .type = FS_FATFS,
    .mnt_point = "/NAND:",
    .fs_data = &fat_fs,
};

static const char *html_content =
    "<!DOCTYPE html><html><head><title>TinyGS Configurator</title>"
    "<style>body{font-family:sans-serif;max-width:600px;margin:40px auto;padding:20px;background:#f4f4f9;}"
    ".card{background:white;padding:20px;border-radius:8px;box-shadow:0 2px 4px rgba(0,0,0,0.1);}"
    "input{width:100%;padding:8px;margin:8px 0;box-sizing:border-box;border:1px solid #ccc;border-radius:4px;}"
    "button{background:#5a67d8;color:white;border:none;padding:10px 20px;border-radius:4px;cursor:pointer;width:100%;font-size:16px;}"
    "button:hover{background:#434190;}</style>"
    "</head><body>"
    "<div class='card'>"
    "<h1>TinyGS Setup</h1>"
    "<p>Configure your Ground Station and join the Thread network.</p>"
    "<hr>"
    "<label>Station ID:</label><input type='text' id='station' placeholder='MyTinyGS'>"
    "<label>MQTT Password:</label><input type='password' id='pass' placeholder='Password'>"
    "<br><br>"
    "<button onclick='saveConfig()'>Save config.json to Drive</button>"
    "<p style='font-size:0.8em;color:#666;'>After saving, scan the QR code in Home Assistant to finish setup.</p>"
    "</div>"
    "<script>"
    "function saveConfig() {"
    "  const config = {"
    "    station: document.getElementById('station').value,"
    "    password: document.getElementById('pass').value"
    "  };"
    "  const blob = new Blob([JSON.stringify(config, null, 2)], { type: 'application/json' });"
    "  const a = document.createElement('a');"
    "  a.href = URL.createObjectURL(blob);"
    "  a.download = 'config.json';"
    "  a.click();"
    "}"
    "</script>"
    "</body></html>";

static void setup_usb_storage(void)
{
    struct fs_file_t file;
    struct fs_dirent entry;

